In [1]:
import numpy as np
import pandas as pd

##### Creation Date:
##### January 30 2022
##### Created By Alperen KOLAMUC

#### Data

In [2]:
student_df = pd.read_csv("student.csv")

In [3]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

#### Satır Değerlerini Güncellemek
##### List ile Güncellemek

In [4]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [5]:
student_df.loc[2]

name        Sinan
lastName    Engin
age            48
number        105
Name: 2, dtype: object

In [6]:
student_df.loc[2] = ["Ahmet", "Çakar", 50, 205]

In [7]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Ahmet    Çakar   50     205
3      Fırat  Aydınus   42     216

* Kaç tane sütun var ise o kadar değer verilmesi gerekir

In [8]:
student_df.loc[2] = ["Rasim", "Ozan", 35]

ValueError: Must have equal len keys and value when setting with an iterable

#### Spesifik Bir Değeri Güncellemek

In [9]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Ahmet    Çakar   50     205
3      Fırat  Aydınus   42     216

In [10]:
student_df.loc[2, "name"]

'Ahmet'

In [11]:
student_df.loc[2, "name"] = "Orhan"

In [12]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Orhan    Çakar   50     205
3      Fırat  Aydınus   42     216

#### at & iat
* `at` ve `iat`, `loc` ve `iloc` gibi, sadece scalar değerler üzerinde işem yapabiliyorlar, array işlemleri için uygun değil ama daha hızlı erişim sağlıyorlar

In [13]:
student_df.at[2, "name"]

'Orhan'

In [14]:
student_df.at[2, "name"] = "Ahmet"

In [15]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Ahmet    Çakar   50     205
3      Fırat  Aydınus   42     216

In [16]:
student_df.iat[2, 0] = "Texas"

In [17]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Texas    Çakar   50     205
3      Fırat  Aydınus   42     216

#### Birden Çok Satırı Aynı Anda Değiştirmek

In [18]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Texas    Çakar   50     205
3      Fırat  Aydınus   42     216

In [19]:
student_df["name"]

0      Alperen
1    Cristiano
2        Texas
3        Fırat
Name: name, dtype: object

In [20]:
str.lower("Ahmet")

'ahmet'

In [21]:
"Ahmet".lower()

'ahmet'

In [22]:
student_df["name"].str.lower()

0      alperen
1    cristiano
2        texas
3        fırat
Name: name, dtype: object

#### General Error

In [23]:
student_df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Texas    Çakar   50     205
3      Fırat  Aydınus   42     216

In [24]:
student_df["age"]

0    18
1    35
2    50
3    42
Name: age, dtype: int64

In [27]:
filt = (student_df["age"] < 36)

In [28]:
filt

0     True
1     True
2    False
3    False
Name: age, dtype: bool

In [29]:
student_df[filt]

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303

In [32]:
student_df[filt]["lastName"] == ["Kolamuc", "Ronaldo"]

0    True
1    True
Name: lastName, dtype: bool